{
    "Drowning": {
        "asset": "drowning_header",
        "documentation": [
            "Drowning",
            "Dream expert Cynthia Richmond writes in her book Dream Power: How to Use Your Night Dreams to Change Your Life, that \"fear of drowning in the language of dreams is a fear of getting too involved in feelings, a fear of losing one's self.\"... Depending on where you are and what you drown in, the meanings will probably be different.",
            "Dreaming that you're in an ocean",
            "\"suddenly being swept under a wave or tide.\" For this, they say \"this would indicate that the dreamer has been hit by a sudden situation in life that is difficult to process or emotionally handle.\" Whereas, \"If the wave throws the dreamer into the rocks or runs them aground, this can represent deliberate intent from others to 'bash' him with hurtful words or actions and they are left in an emotional undertow by it.\"",
            "Dreaming that you're in a pool",
            "Since a pool is manmade, its significance in dreams is different to a natural body of water, and might indicate that there might be some superficially good things going on in your life, that may not be quite so pretty in reality.",
            "If you survive the drowning",
            "if in your dream you survive the drowning, it might correspond to an \"emotional rebirth\" you may be having in your life, according to Dream Moods. This is backed up by Auntyflo, who report that \"The immersion in water can represent a rebirth, much like the fact we are back in our mother's womb which is an archetypical symbol in dream psychology.\""
        ]
    },
    "Death": {
        "asset": "death_header",
        "documentation": [
            "Death",
            "\"Death in dreams is really about some kind of change or ending you’re dealing with in your real life,\" says Lauri Quinn Loewenberg, professional dream analyst and author. \"The subconscious will show us this change in the form of a death so we can better understand the finality of it. We can let go of that which we no longer need so we can grow and embrace that which is coming.\" Below, Loewenberg analyzes different dreams about death and what they may mean in terms of what’s going on in your life.",
            "If you dreamed of your own funeral",
            "Loewenberg says this dream often makes people worry that their death is right around the corner, but this isn’t the case. “[People] get this when a phase of their life has ended. Death is the end of life, but to the dreaming mind, death is the end of life as you now know it.”",
            "If you die peacefully in your dream",
            "“This is a really good indication that the change you’re going through, you’re okay with it. You’re going through a welcome change.”",
            "If you die violently in your dream",
            "While dying peacefully indicates a welcome change, Loewenberg explains that dying violently is the opposite. “There’s a change happening that you’re resisting, or you’re afraid of the change that’s going on.”",
            "If someone you know kills you in your dream",
            "“If it’s someone you deal with closely, like a family member or best friend or your partner, then that means they are probably urging you to make some sort of change in real life. Death in a dream is a natural-occurring change that’s happening, whereas murder is a forced change: You have to force yourself to quit smoking or you have to force yourself to cut off a friendship. If someone you know and are close to is trying to kill you, then they are probably urging you to make a change that you are resistant to.”",
            "If a stranger kills you in your dream",
            "“If it’s not an actual person you know, then this stranger is going to represent a part of yourself, or it can represent just the forces at work that are making this change happen.” If you have this dream, Loewenberg encourages you to ask yourself, “Am I feeling pressured to change?”",
            "If you know you’re going to die in your dream and you can’t escape it",
            "This has to do with a change you’re anticipating and know is going to happen, according to Loewenberg. “That sort of dream is preparing you for this inevitable ending.”",
            "If you wake up right before you die in your dream",
            "Loewenberg explains that this could just be your body’s physiological response to a fear of death. “Or you can wake up before the death happens because in real life, the actual change has not been completed. You’re on the verge — you’re on the cusp of it.”",
            "If you don’t wake up immediately after dying in your dream",
            "“So many people tell me they’ve actually experienced the feeling of death and leaving the body. That dream would indicate that change has happened. If you feel yourself leaving your body in that dream, that’s a good indication that you’re feeling like this change is transforming you.”",
            "If your child dies in your dream",
            "Loewenberg says this is one of the most disturbing death dreams that anyone can have, but it’s much less scary than it seems. “It’s because your child has reached some sort of milestone, it’s the end of the phase of their life. Whenever they start crawling, start walking, start feeding themselves, all these different big phases of life mark the end of that younger child. It’s actually the way we kind of grieve — the loss of that phase of their life. Because once you have a child, time goes really, really fast.”",
            "If your partner dies in your dream",
            "There are some questions to ask yourself if you’re having this dream, Loewenberg says. “What change is happening with them? Have they lost a job? Have they lost weight? Are they working a lot more and you never see them? How have they changed, or how has your relationship with them changed?”",
            "If your friend dies in your dream",
            "This will likely mean that your relationship with your friend is changing, but Loewenberg says that if nothing is different, this dream could indicate something else. “Your friend is going to represent a part of yourself. How are you like your friend? What quality do you share? Maybe your friend is always cheerful and the one that’s always emotionally supportive and you dream she dies. What’s going on with that part of you? Have you become depressed? Are you in need of cheering up? Are you having a hard time finding happiness right now?”",
            "If you kill someone in your dream", "“If you’re the one doing the killing, then you are the one actively making some kind of change in your real life. So if you are trying to quit drinking, if you are trying to eat better, if you are trying to change careers, what part of yourself or what part of your own life are you killing off, ending?”",
            "If you die young in your dream",
            "“If you are a younger self in your dream and you die, you’ve got to ask yourself, what was going on with you at that age? What were you like? What were you dealing with? Is there something from that point in time that you’ve been carrying with you but that now you’re finally over?”",
        ]
    },
    "Money": {
    "documentation": [
        "Money"
        ]
    },
    "Flying": {
    "documentation": [
        "Flying"
        ]
    },
    "Naked": {
    "documentation": [
        "Naked"
        ]
    },
    "Sex": {
    "documentation": [
        "Sex"
        ]
    },
    "Water": {
    "documentation": [
        "Water"
        ]
    },
    "House": {
    "documentation": [
        "House"
        ]
    },
    "Teeth": {
    "documentation": [
        "Teeth"
        ]
    },
    "Journey": {
    "documentation": [
        "Journey"
        ]
    },
    "Chased": {
    "documentation": [
        "Chased"
        ]
    },
    "Atacked": {
    "documentation": [
        "Attacked"
        ]
    },
    "Injured": {
    "documentation": [
        "Injured"
        ]
    },
    "Car": {
    "documentation": [
        "Car"
        ]
    },
    "House Damage": {
    "documentation": [
        "House Damage"
        ]
    },
    "Poor Performance": {
    "documentation": [
        "Poor Performance"
        ]
    },
    "Falling": {
    "documentation": [
        "Falling"
        ]
    },
    "Public Embaarrassment": {
    "documentation": [
        "Public Embaarrassment"
        ]
    },
    "Being Late": {
    "documentation": [
        "Being Late"
        ]
    },
    "Telephone Malfunction": {
    "documentation": [
        "Telephone Malfunction"
        ]
    },
    "Natural Disasters": {
    "documentation": [
        "Natural Disasters"
        ]
    },
    "Lost": {
    "documentation": [
        "Lost"
        ]
    },
    "Trapped": {
    "documentation": [
        "Trapped"
        ]
    },
    "Ghost": {
    "documentation": [
        "Ghost"
        ]
    }
}
